Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །ཡོངས་སུ་སྤངས་ན་ཀུན་རྟོག་སྟེ།
en: But when there is complete renunciation, there is no conceptual thought.

source: །དེ་ཕྱིར་དེ་གཉིས་ཡོངས་སུ་སྤང་།
en: Therefore, he should abandon this duality of ‘empty’ and ‘not empty.’

source: །གཉིས་ཀྱིས་གཟུང་བ་ཡོངས་སྤངས་པ།
en: “When he gives up dualistic grasping,

source: །རྣམ་གྲོལ་གནས་དང་བྲལ་བ་སྟེ།
en: He is liberated—free of reference point.

source: །ང་ཞེས་བྱ་བའི་ཀུན་རྟོག་འདི།
en: Since ‘I’ is also a concept,

source: །དེ་ཕྱིར་དེ་ནི་ཡང་དག་སྤང་།
en: It should also be abandoned.

source: །རྣམ་པ་མེད་ཅིང་དོགས་པ་མེད།
en: “Without fluctuations, without doubts,

source: །འདོད་པ་མེད་ཅིང་སྡིག་པ་བྲལ།
en: Without yearnings, the impurities gone,

source: །ཐོག་མ་ཐ་མའི་རྟོག་ལས་གྲོལ།
en: Free of thoughts of a beginning and an end,

source: །ནམ་མཁའ་ལྟ་བུར་མཁས་པས་བསྒོམ།
en: The wise practitioner should engage in a sky-like meditation.

source: །སྙིང་རྗེ་ལྡན་པས་སེམས་ཅན་ལ།
en: “But a compassionate practitioner also

source: །རྒྱབ་ཀྱིས་ཕྱོགས་པར་མི་བྱ་ཞིང་།
en: Should never turn his back on living beings.

source: །སེམས་ཅན་ཡོད་དང་ཡོད་མིན་ཞེས།
en: ‘Beings exist’ or ‘beings do not exist’—

source: །དེ་ལྟར་ཡོངས་སུ་བརྟག་མི་བྱ།
en: He should not speculate in this way.

source: །ཤེས་རབ་ཅེས་ནི་རབ་ཏུ་གྲགས། །ཡིད་བཞིན་ནོར་ལྟར་མ་ལུས་པའི།
en: Has been proclaimed to be insight.

source: །ཐམས་ཅད་དོན་བྱེད་སྙིང་རྗེ་ཉིད།
en: Compassion is bringing about the welfare of all beings, Like a wish-fulfilling gem. “On the meditational level without reference

source: །དམིགས་མེད་གནས་སུ་ཤེས་རབ་དང་། །དམིགས་མེད་སྙིང་རྗེ་ཆེན་པོ་ཉིད།
en: There is great compassion without reference. This great compassion is one with insight,

source: །བློ་དང་ལྷན་ཅིག་གཅིག་གྱུར་པ། །ནམ་མཁར་ནམ་མཁའ་ཇི་ལྟ་བའོ།
en: Just like space contained within space.

source: །གང་ལ་སྒོམ་པ་པོ་ཡང་མེད།
en: “Where there is no meditator,

source: །གང་ཡང་རྣམ་པར་སྒོམ་པའང་མེད།
en: There also is no meditation,

source: །བསྒོམ་བྱ་ཉིད་ཀྱང་ཡོད་མིན་པ།
en: And no object to meditate upon—

source: །དེ་ཡི་དེ་ཉིད་སྒོམ་པར་བརྗོད།
en: This is called meditation on reality

source: །གང་ཡང་བྱ་བ་ཡོད་མིན་འདིར།
en: “So, too, there is no action here,

source: །བཟའ་བྱ་ཉིད་ཀྱང་ཡོད་མ་ཡིན།
en: And also nothing to partake of.

source: །བྱེད་པོ་བཟའ་ལས་རྣམ་པར་གྲོལ།
en: Free from the agent and the experiencer,

source: །དོན་དམ་རྣམ་པར་བསྒོམས་པས་ན།
en: Such is meditation on the ultimate truth

source: །འདི་ལ་སྒྲུབ་པོ་གང་ཡང་མེད།
en: “Nor is there a practitioner of any kind here,

source: །གང་ཡང་སྟོང་པར་བྱེད་པ་མེད།
en: Nor anyone who offers praise.

source: །དོར་བ་ཅུང་ཟད་མེད་པར་བརྗོད།
en: There is, therefore, nothing whatsoever to abandon

source: །བླང་བའང་ཅུང་ཟད་ཡོད་མ་ཡིན།
en: And nothing whatsoever to adopt. “This state has the nature of a city of gandharvas.

source: །དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་དང་། །སྒྱུ་མ་སྨིག་རྒྱུ་འདྲ་བ་དང་། །འཕྲོག་པ་ཟླ་བའི་གྲོང་ཁྱེར་མཚུངས།
en: Similar to a magical display or a mirage, And the same as the city of Hariścandra,

source: །རྨི་ལམ་རྩེ་བ་ལྟ་བུར་བལྟ། །སྒྱུ་མ་ཇི་བཞིན་ཐམས་ཅད་དུ།
en: It is perceived as if it were play in a dream.

source: །བལྟ་བ་ཉིད་དང་རེག་པར་བྱ།
en: “It is seen and touched

source: །འགྲོ་བ་ཐམས་ཅད་གནས་པ་ནི།
en: As an illusion in every way.

source: །གང་ཡང་རྙེད་པར་མི་འགྱུར་ཏེ།
en: It is impossible to find Lasting existence for any living being.

source: །སྦྱོར་བ་འདུས་པས་བསམ་མི་ཁྱབ།
en: “In the inconceivable commingling of union

source: །རྨི་ལམ་སད་པ་ལྟ་བུ་ནི།
en: Which is like the conjunction of a dream and subsequent awakening, There is a meeting of two sex organs,

source: །ཇི་ལྟར་གཞོན་ནུའི་གཟུགས་ཀྱིས་ནི། །དབང་པོ་གཉིས་ནི་འདུས་པ་ཡིས།
en: The same as in the case of a divinely youthful form.

source: །བྷ་གར་ལིང་ག་བཞག་ནས་ནི།
en: “When one has placed the liṅga inside the bhaga,

source: །སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ།
en: This is the meditation of recollecting the buddhas—

source: །ཡེ་ཤེས་ཅི་ཞིག་སྐྱེ་ཞེ་ན།
en: A certain amount of wisdom will arise,

source: །ཐོག་མ་དབུས་མཐའ་དྲི་མ་མེད།
en: Stainless in the beginning, middle, and end.

source: །རང་གིས་རིག་པའི་ཡེ་ཤེས་དེ།
en: “This wisdom is self-reflexive awareness

source: །གཞན་དུ་སྨྲ་བར་མི་ནུས་སོ།
en: It is impossible to describe this otherwise.

source: །གཟུགས་རྣམས་ཐམས་ཅད་ལྟ་བ་དང་། །སྒྲ་རྣམས་ཉིད་ཀྱང་ཉན་པ་དང་། །སྨྲ་བ་དང་ནི་རྒོད་པ་དང་། །སྣ་ཚོགས་རོ་ནི་ཟ་བ་དང་། །ལས་རྣམས་ཐམས་ཅད་བྱེད་པ་ནི།
en: While perceiving all manner of forms, While listening to sounds, “While talking, laughing, Or tasting different tastes, And while performing all kinds of actions

source: །གཞན་དུ་སེམས་ནི་མི་འགྲོ་བས།
en: With the mind not wandering elsewhere, “There always arises nondual union

source: །དེ་ཉིད་རིག་པའི་རྣལ་འབྱོར་པའི། །རྣལ་འབྱོར་རྟག་ཏུ་སྐྱེ་བར་འགྱུར།
en: For yogins who know reality.

source: །འདི་ནི་གཉིས་སུ་མེད་པར་བརྗོད།
en: This is called nonduality

source: །འདི་ནི་བྱང་ཆུབ་སེམས་མཆོག་ཉིད།
en: This is the ultimate bodhicitta.

source: །རྡོ་རྗེ་རྡོ་རྗེ་སེམས་དཔའ་དཔལ།
en: “This is vajra and glorious Vajrasattva,

source: །རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་ཉིད།
en: The one who is fully awakened, and also awakening itself.

source: །འདི་ནི་ཤེས་རབ་ཕ་རོལ་ཕྱིན།
en: This is also the perfection of wisdom,

source: །ཕ་རོལ་ཕྱིན་པ་ཀུན་གྱི་དངོས།
en: Which comprises all the perfections.

source: །མཉམ་ཉིད་བསམ་བྱ་ཉིད་དུ་གསུངས།
en: “This is said to be equanimity,

source: །སངས་རྒྱས་ཀུན་མཆོག་བསྒོམ་བྱ་ཉིད། །འགྲོ་བ་བརྟན་དང་གཡོ་བའི་བདག །བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་དང་། །རྫོགས་སངས་རྒྱས་དང་ཉན་ཐོས་སོགས།
en: The foremost meditation of all buddhas.

source: །དེ་ཉིད་ལས་ནི་ཐམས་ཅད་སྐྱེས།
en: From within this very state everything arises—

source: །དངོས་དང་དངོས་མེད་སྦྱོར་བྲལ་བ།
en: The world’s animate and inanimate objects, “Infinite bodhisattvas, fully awakened buddhas, Hearers, and so forth. The yogin, disconnected from both existence and nonexistence,

source: །རྣལ་འབྱོར་པས་ནི་དེ་ཉིད་བསྒོམ།
en: Should cultivate this state only.

source: །དངོས་དང་དངོས་མེད་རྣམ་གྲོལ་བ།
en: “If he meditates, free from existence and nonexistence,

source: །བསྒོམས་ན་མྱུར་དུ་འགྲུབ་པར་འགྱུར།
en: He will swiftly become accomplished,

source: །མ་ལུས་སྐྱོན་ལ་སྡང་བ་དང་། །ཀུན་ནས་ཉོན་མོངས་རྒྱབ་ཕྱོགས་དེས།
en: Feeling distaste for all his faults, And turning his back upon the afflictions.

source: །དཔལ་ལྡན་བདེ་གཤེགས་ཡོན་ཏན་རྣམས།
en: “The endless qualities of the glorious bliss-gone ones

source: །མཐའ་ཡས་དེ་ལས་སྐྱེ་པར་འགྱུར།
en: Will arise from his meditation.

source: །ཀུན་རྟོག་མང་པོའི་མུན་པས་ཁྱབ་གྱུར་པའི།
en: “The mind, which is overcome by the darkness of many concepts,

source: །རབ་ཏུ་འཇོམས་པས་སྨྱོ་ཞིང་བློ་འགྱུ་བ།
en: Mad as a storm and fickle as lightning,

source: །ཆགས་སོགས་དགག་དཀའི་དྲི་མས་གོས་གྱུར་པའི།
en: Stained with the dirt of unrestrainable desire, and so forth—

source: །སེམས་ནི་རྡོ་རྗེ་ཅན་གྱིས་འཁོར་བར་གསུངས།
en: This mind has been declared by the vajra holder to be saṃsāra.

source: །རང་བཞིན་འོད་གསལ་རྟོག་ལས་རྣམ་པར་གྲོལ།
en: “But the mind, which is luminous and free from conceptuality,

source: །འདོད་ཆགས་ལས་སོགས་དྲི་མས་གོས་བྲལ་བའི།
en: Which has lost its layer of the dirt of desire, and so forth, Which lacks both the perceived and the perceiver—

source: །གཟུང་བ་དང་ནི་འཛིན་མེད་སེམས་དཔའ་མཆོག །དེ་ཉིད་མྱ་ངན་འདས་པ་མཆོག་ཏུ་གསུངས།
en: This mind has been declared by the best of beings to be supreme nirvāṇa

source: །སྡུག་བསྔལ་ཕུང་པོ་དུ་མའི་མཚན་གྱུར་པ།
en: “As a cause for the manifold heap of suffering,

source: །འདི་ལས་གཞན་དུ་ཅུང་ཟད་ཡོད་མ་ཡིན།
en: There is nothing other than this mind.

source: །བདེ་བ་མཐའ་ཡས་འབྱུང་བའི་རྒྱུར་གྱུར་པ།
en: And likewise, as a cause for the emergence of infinite happiness,

source: །དེ་ལས་གཞན་དུ་གྲོལ་བའང་ཡོད་མ་ཡིན།
en: There is nothing other than this mind, O seekers of liberation!

source: །སྡུག་བསྔལ་མ་ལུས་ཟད་པར་འདོད་པ་དང་། །རྫོགས་སངས་རྒྱས་ཀྱི་བདེ་མཆོག་ཐོབ་འདོད་པས།
en: “Those who have resolved on the destruction of all suffering, Who wish to obtain the genuine happiness of the fully awakened ones,

source: །སེམས་ནི་བརྟན་པར་བྱས་ནས་འབད་པས་དཔྱད།
en: They should stabilize their minds and investigate with care,

source: །དེ་ཡི་རང་བཞིན་དངོས་པོ་མེད་པར་བྱེད།
en: Construing this mind to be devoid of independent existence. “For as long as the minds of beings who are subject to birth

source: །ཇི་སྲིད་རྟོག་པའི་མུན་པའི་ཡོལ་སྟུག་པོ།
en: Are hampered by the thick, dark veil of conceptual thinking,

source: །སྐྱེ་དགུའི་ཡིད་བསྒྲིབས་སྡུག་བསྔལ་མཐའ་ཡས་ལ།
en: Their suffering will be endless.

source: །ཇི་སྲིད་དེ་ནས་དེ་ནི་བྲལ་ཡིན་ཏེ།
en: But as soon as their minds are free of this veil,

source: །དེ་སྲིད་བདེ་བ་རྒྱ་ཆེན་ཐ་དད་མིན། །མཉམ་པ་ཉིད་ཀྱི་མཐར་ཐུག་འཕགས་དགྱེས་པའི།
en: “Their happiness will be immense and unequaled.

source: །དེ་ཡི་ཟད་ཕྱིར་རང་གི་བྱ་བ་ཡང་།
en: The noble ones should therefore exert themselves For the sake of removing this veil—

source: །རྒྱས་པ་དེ་ཡི་ཡན་ལག་འགྲོ་བ་བལྟ།
en: They will then witness the great expansion of their happiness.

source: །དེ་ལྟར་དེ་ཁོ་ན་ཉིད་ཀྱི་རྣལ་འབྱོར་པས་རྣལ་འབྱོར་པས་རྣལ་འབྱོར་གྱི་ངེས་པ་བྱས་ནས་བཀའི་གནང་བ་དང་། རང་གི་དམ་ཚིག་ལ་གནས་པས་སྒོམ་པར་བྱེད་ན་ལག་པའི་ཕྱག་རྒྱ་དང་། སྔགས་དང་སྐུ་གཟུགས་ཀྱི་ང་རྒྱལ་བསྒོམ་པ་དང་། དམ་ཚིག་གི་ཐུན་མོང་གི་དངོས་གྲུབ་སྒྲུབ་པར་བྱེད་པ་ཡིན་ནོ་ཞེས་པས་ཅི་ཞིག་བྱ།
en: “In this way, the practitioner of the true state , resolved upon the practice, authorized by his master, and abiding by his samaya, should practice meditation. If he does, what would be the use of committing to practice hand mudrās, mantras, making deity statues, or cultivating himself as deity, all of which can only produce common siddhis?

source: སངས་རྒྱས་ཉིད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་མཚོན་པ་མངོན་དུ་རང་གི་ལྷའི་རྣལ་འབྱོར་ཡིན་ཏེ་བསྐྱེད་པ་དང་། དེ་མཚོན་པ་ན་གནས་གསུམ་པོ་ནམ་མཁའ་ལྟ་བུར་འགྱུར་རོ།
en: Intent on buddhahood, he should clearly set up his goal and do the practice of the chosen deity. In this way, when the goal has been reached, the threefold universe will become for him like the sky.

source: །གཞུང་ཐམས་ཅད་སྤངས་ནས་ཐོབ་པའི་གནས་ཀྱི་བསམ་གཏན་གྱི་རྣལ་འབྱོར་དེ་ལ་བརྩོན་པས་རང་རིག་པ་ཙམ་ལ་སྤྲོ་བས་ཉིན་དང་མཚན་དུ་གོམས་པར་བྱའོ།
en: Consequently, the skilled practitioner, having renounced everything, applies himself to the practice of meditation in the state he has attained, cultivating day and night self-reflexive awareness exclusively.

source: །རིའི་རྩེ་མོ་དང་། ཞི་བའི་གནས་དང་། པདྨའི་ཚལ་དང་། རྒྱལ་པོའི་ཚལ་དང་། དབེན་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་གནས་དང་། རང་གི་ཁྱིམ་མམ། སེམས་ལ་མངོན་པར་འདོད་པ་ཐམས་ཅད་མཁྱེན་པས་སྔགས་པ་འདིའི་ནང་དུ་གང་དང་གང་གི་གནས་དེར་གནས་ཤིང་སྔགས་ཤེས་པ་སྤྲོ་བ་དང་ལྡན་པ་དེས་སྒོམ་པར་བྱེད་དེ།
en: “On a mountaintop, in a Śiva temple, in a lotus garden, on the ocean’s shore, in a royal park, in any secluded place, in his own home, in any place pleasing to the mind that is praised by the omniscient ones—in locations like these, in whatever place the adept of mantra may find himself—there he should practice meditation with tenacity.

source: ཐབས་དང་ཤེས་རབ་མ་རྟོགས་པར་སངས་རྒྱས་ཉིད་མངོན་དུ་ཐོབ་པར་མི་འགྱུར་རོ།
en: Awakening can never be directly attained without insight and skillful means.

source: །དེའི་ཕྱིར་ཤེས་རབ་མ་དངོས་སུ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྦྱིན་པར་བྱེད་པ་བཟང་མོ་སྤང་བར་མི་བྱ་སྟེ། ཕྱག་རྒྱ་རེ་རེ་དང་ལྡན་པ་འདི་མ་གཏོགས་པར་དངོས་གྲུབ་སྟེར་བར་མི་འགྱུར་རོ། །དེ་ཕྱིར་ཡེ་ཤེས་སྐྱེད་པ་ཡི། །ཕྱག་རྒྱ་བཞི་ནི་སྦྱར་བར་བྱ།
en: Therefore, if he abandons the wisdom consort , the sublime lady who grants complete awakening, siddhis that are endowed with each of the seals will not be bestowed. For that reason, he should apply the four seals that give rise to wisdom.

source: །གཏི་མུག་དམ་ཚིག་ཕྱག་རྒྱ་སྟེ།
en: “Ignorance is the samayamudrā

source: །ཞེ་སྡང་ཕྱག་རྒྱ་ཆེན་པོར་བརྗོད། །ཕྲག་དོག་ལས་ཀྱི་ཕྱག་རྒྱ་སྟེ།
en: Hatred is always said to be the mahāmudrā , and envy the karmamudrā .

source: །འདོད་ཆགས་ཆོས་ཀྱི་ཕྱག་རྒྱ་བདག །ཡོ་གིས་ཕྱག་རྒྱ་སྣ་ཚོགས་འདི། །བསྐྱེད་ནས་རིག་མ་བཟའ་བར་བྱ།
en: Desire is, by its nature, the dharmamudrā

source: །དེ་ལ་གཉིས་ཀ་ཡང་ལྷའི་གཟུགས་སུ་མངོན་དུ་བསམས་ནས་གཏི་མུག་ལས་ཞི་བ་དང་། ཁྲོ་བ་ལས་མ་རུངས་པ་དང་། འདོ་ཆགས་ལས་ཆགས་པས་ལས་རྣམས་བྱེད་དོ།
en: The practitioner should manifest these different seals and sexually enjoy and serve his consort , regarding them both to be deity by nature.

source: །དེའི་དོན་དུ་རབ་ཏུ་བྱེད་པ་ལྔ་པོ་འདི་རྣམས་ཀྱིས་རྒྱལ་བ་རྣམས་ཡིན་ནོ།
en: “Being tranquil because of ignorance, wrathful because of anger, or impassioned because of desire, he performs different actions to fulfill the aims of these five emotions. With these five, he becomes a victorious one.

source: །སྔ་དྲོ་དང་། ཉི་མའི་མཐའ་དང་། ཉི་མ་ཕྱེད་དང་། །ནམ་ཕྱེད་ཀྱི་དུས་སུ་ཡང་ཕྱག་རྒྱའི་རྣལ་འབྱོར་བྱའོ།
en: “At dawn, at the close of the day, at midday, or at midnight he should thoroughly do the practice with the consort

source: །མཉམ་པར་སྦྱོར་བ་ལས་གཞན་དུ་ནི་འགྲུབ་པར་མི་འགྱུར་རོ།
en: Otherwise there will be no accomplishment.

source: །བསྟན་པ་ལ་སྨོད་པའི་འཇིགས་པ་དང་། སྐྱེ་བོ་གདུག་པའི་ནང་དུ་གནས་པའི་རྣལ་འབྱོར་པས་རང་གི་སེམས་འབའ་ཞིག་དེ་བསམས་པས་སེམས་ལ་ལྷག་པར་མོས་པ་མངོན་དུ་བྱའོ།
en: When the practitioner stays among uncouth people, and is afraid that the teachings might be disparaged, he should visualize the union with consort in his own mind only, manifesting it in his imagination.

source: །གང་ཞིག་ཡང་རྣལ་འབྱོར་པ་བརྩོན་འགྲུས་ཀྱི་འབད་པས་རྣལ་འབྱོར་འདི་བསྒྲུབ་པར་བྱའོ།
en: Otherwise, the practitioner should do this practice assiduously with a real consort

source: །ཤེས་རབ་མངོན་དུ་མ་རྙེད་ན་བྱོལ་སོང་དག་ལའང་རྟག་ཏུ་གོམས་པར་བྱའོ། །དེ་ལྟར་གང་ཞིག་རྣལ་འབྱོར་པས་གལ་ཏེ་པདྨ་འཛིན་པ་ལ་མངོན་དུ་ཉི་མ་རེ་རེའམ། ཟླ་བ་སོ་སོའམ། ལོ་ལ་རེག་པར་མི་བྱེད་ན་དམ་ཚིག་ཉམས་པར་འགྱུར་རོ།
en: If a wisdom consort cannot be acquired in the flesh, he should practice perpetually with those in ‘the horizontal profession.’ For if the practitioner does not physically touch the best of lotuses every day, every month of the year, his samaya becomes damaged.

source: །དམ་ཚིག་ཉམས་པས་རྣལ་འབྱོར་པ་བག་མེད་པ་སྐྱེ་བར་འགྱུར་ཏེ།
en: And when the samaya is damaged, he becomes negligent of his practice.

source: བྱང་ཆུབ་སེམས་དཔའི་དམ་ཚིག་བླང་བར་བྱས་ན་ཡང་མི་བྱེད་པར་སྡོམ་པ་གཟུང་བར་བྱ་སྟེ།
en: Having restored his samaya of a bodhisattva, he should vow not to let this happen again thenceforth.

source: དེའི་ཕྱིར་ཀུན་གྱིས་སྡོམ་པ་དང་ལྡན་ཞིང་དེ་ཁོ་ན་ལ་གནས་པས་ཕྱག་རྒྱའི་རྣལ་འབྱོར་བྱའོ། །གསང་བའི་ཉེ་བའི་རྫས་དང་སྔགས་དང་རྒྱུད་ཀྱིས་འདི་སྐད་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡང་དག་པར་སྦྱོར་བའི་རྣལ་འབྱོར་གྱིས་རྟག་ཏུ་ཉེ་བར་འདུག་སྟེ།
en: Consequently, he should do the practice with the consort in secret, using secret substances, mantra, and tantric techniques, while keeping his samaya, following his prescribed conduct, and abiding in reality .

source: བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་སུ་གནས་གསུམ་པོ་རྩེ་གཅིག་པའི་ཚུལ་གྱིས་བསྒོམ་པར་བྱའོ།
en: Having attained awakening in this way, having inevitably reached the inconceivable state by means of the correct practice of union , he should meditate one-pointedly on the threefold universe as the inconceivable domain.”

source: །ཐབས་དང་ཤེས་རབ་ཀྱི་དོན་བསྒོམ་པ་ཞེས་བྱ་བ་གཉིས་པ་ལས་རབ་ཏུ་བྱེད་པ་གཉིས་པའོ།།
en: This concludes the second part of the second chapter, called “Meditating on the Meaning of Insight and Skillful Means.”

source: །།དེ་ནས་འཁོར་ལོ་ཐམས་ཅད་ཀྱི།
en: “Now I will teach

source: །རྣམ་པར་འཕྲུལ་པ་ཡང་དག་བཤད།
en: The miraculous manifestation of all maṇḍalas—

source: །དཔལ་ལྡན་རྡོ་རྗེ་སེམས་སོགས་ལྷའི།
en: The maṇḍala of glorious Vajrasattva and other deities,

source: །ཐམས་ཅད་ལས་ནི་སྣ་ཚོགས་བྱེད།
en: Which is complete and perfect in every way.

source: །གསང་བ་མཆོག་གི་དགྱེས་པ་ན།
en: “Within the pleasure of the supreme secret,

source: །ཐམས་ཅད་བདག་ཉིད་འདི་ལ་བསྒྲུབ།
en: One should practice the nature of them all.

source: །རྣམ་པར་བྲལ་དང་གནས་སུ་ཡང་།
en: In a secluded place, a residence,

source: །རང་གི་ཚལ་སོགས་རྣམས་སུ་ཡང་།
en: Or one’s own garden

source: །ཀུན་ལས་སྣ་ཚོགས་ཕྱག་རྒྱ་སྟེ།
en: “One should perform each of the seals thoroughly,

source: །ཀུན་ལས་སྣ་ཚོགས་སྡོམ་པས་ནི།
en: And together with each of the Saṃvaras, in all their detail,

source: །ཀུན་ལས་སྣ་ཚོགས་བྱ་བ་རྣམས།
en: Complete all the other features necessary in a maṇḍala,

source: །ཇི་ལྟར་བདེ་བར་བསྒྲུབ་པར་བྱ།
en: At one’s leisure.

source: །བདེ་གཤེགས་ཀུན་གྱི་དཀྱིལ་འཁོར་ནི།
en: “The maṇḍala of all the tathāgatas

source: །སྟོང་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཉིད།
en: Is the gnosis of emptiness itself;

source: །ཁྲོ་བོའི་སྒྲུབ་ཐབས་ཐམས་ཅད་དང་། །ཞི་བ་རྣམས་ཀྱི་ལྷ་རྣམས་ལ།
en: It accomplishes all the practices Of wrathful and peaceful deities.

source: །ཅི་ཞིག་ང་ཡིས་བཤད་པར་བྱ།
en: “How shall I explain the inconceivable

source: །བསམ་གྱིས་མི་ཁྱབ་སངས་རྒྱས་གར།
en: Dance of the buddhas,

source: །བསྒོམ་པ་ལྷ་ཡི་རྣལ་འབྱོར་དང་། །སྔགས་ཀྱི་བཟླས་པའི་ཆོག་རིམ་དང་། །བྲིས་སྐུ་འམ་ནི་སྐུ་གཟུགས་ཀྱང་།
en: The meditation of deity practice, The ritual procedure of mantra recitation, “Or the images painted or sculpted, Or any images mentally created?

source: །སེམས་ཀྱིས་ཐམས་ཅད་སྤྲུལ་པ་སྟེ།
en: All this has been taught by me in the tantras

source: །སེམས་ཅན་རྣམས་ལ་ཕན་འདོད་ཕྱིར། །ང་ཡིས་རྒྱུད་དུ་བསྒྲགས་པ་ཡིན།
en: For the benefit and advantage of beings.

source: །སྟོང་ཉིད་གཅིག་ལས་རྡོ་རྗེ་ཅན།
en: “While the holder of the vajra of emptiness is only one,

source: །རྡོ་རྗེ་སྙིང་པོས་གསོལ་པ།
en: Vajragarbha said: “Please be so kind to explain, O gentle lord of great bliss,

source: བསྐྱེད་པའི་ཡིག་འབྲུ་གཟུགས་དང་ནི།
en: The nature of the letters and colors visualized in the development stage,

source: །ཕྱག་རྒྱ་དབྱིབས་ཀྱི་ཆོག་རིམ་དང་། །སྔགས་ཀྱི་བཟླས་པའི་ཆོ་ག་ཡང་།
en: And the order and arrangement of the deities’ arms. “Please explain also the rules regarding the mantra recitation,

source: །གང་གིས་སྒྲུབ་པོས་འགྲུབ་འགྱུར་བ། །གཙོ་བོ་ཤིན་ཏུ་དགའ་ཆེན་པོས། །བཀའ་དྲིན་གྱིས་ནི་བསྐྱབ་ཏུ་གསོལ།
en: By means of which the practitioner will become accomplished.”

source: །དང་པོར་བྱམས་པ་བསྒོམ་པར་བྱ།
en: “Firstly, one should cultivate loving kindness;

source: །གཉིས་པར་སྙིང་རྗེ་རྣམ་པར་བསྒོམ།
en: Secondly, compassion;

source: །གསུམ་པར་དགའ་བ་བསྒོམ་པ་དང་། །ཀུན་གྱི་ཐ་མར་བཏང་སྙོམས་སོ།
en: Thirdly, sympathetic joy; And lastly, equanimity.

source: །ཡང་ནི་སྟོང་པའི་བྱང་ཆུབ་སེམས།
en: “Enumerating again, one should first awaken in emptiness;

source: །གཉིས་པ་ལ་ནི་ས་བོན་བསྡུ།
en: Secondly, one should conceive the seed syllable;

source: །གསུམ་པ་ལ་ནི་གཟུགས་བརྙན་རྫོགས།
en: Thirdly, one should generate the complete image of the deity;

source: །བཞི་པ་ལ་ནི་ཡིག་འབྲུ་དགོད།
en: And fourthly, one should do the placement of syllables.

source: །རེ་ཕས་ཉི་མ་སྔོན་དུ་རྣམ་བསྒོམས་ནས།
en: “One should visualize in front a sun disk transformed from the syllable ra,

source: །ཉི་དེར་ཧཱུྃ་བྱུང་སྣ་ཚོགས་རྡོ་རྗེ་སྟེ།
en: And on it a double vajra scepter transformed from the syllable hūṁ

source: །རྡོ་རྗེ་དེ་ཉིད་ཀྱིས་ནི་ར་བ་དང་། །གུར་ཡང་ཆོ་ག་བཞིན་དུ་བསྒོམ་པར་བྱ།
en: One should visualize a surrounding wall and a protective canopy As made of such double scepters.

source: །དང་པོར་རོ་ནི་བསྒོམ་པར་བྱ།
en: “Then the wise practitioner should first visualize a corpse,

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱི་བདག་ཉིད་བརྗོད།
en: Which has the nature of the expanse of phenomena.

source: །དེ་སྟེང་རྣལ་འབྱོར་པ་གནས་ནས།
en: Then, standing on top of it,

source: །ཧེ་རུ་ཀ་ཉིད་རྣམ་པར་བསྒོམ།
en: He should conceive of himself as Heruka.

source: །རང་གི་སྙིང་གར་རེ་ཕ་བསྒོམ།
en: “In his heart he should visualize the syllable ra

source: །དེ་ལས་བྱུང་བའི་ཉི་དཀྱིལ་འཁོར།
en: And arising from it, a sun disk.

source: །དེར་ནི་ཧཱུྃ་གི་དབྱིབས་ཉིད་ནི།
en: On that sun disk he should visualize the syllable hūṁ

source: །ཐབས་དང་ཤེས་རབ་བདག་ཉིད་ཅན།
en: With the nature of wisdom and skillful means,

source: །ཁ་དོག་ནག་པོ་འཇིགས་ཆེན་པོ།
en: “Black in color and very frightening.

source: །ཧཱུྃ་ལས་བྱུང་བའི་རྡོ་རྗེ་ཉིད།
en: The hūṁ then transforms into a vajra scepter.

source: །རྡོ་རྗེ་ལྟེ་བའི་དབུས་གནས་པར།
en: In the center of the scepter’s hub,

source: །ཡང་ནི་ཧཱུྃ་གི་དེ་ཉིད་བསྒོམ།
en: He should once again visualize the very quintessence of hūṁ

source: །དེ་ཉིད་ཡོངས་སུ་གྱུར་བལྟས་ནས།
en: “He should visualize that this transforms

source: །ཞེ་སྡང་བདག་ཉིད་རྣམ་པར་བསྒོམ།
en: Into the lord whose nature is hatred—

source: །རྡོ་རྗེ་སྐྱེ་བ་དཔའ་བོ་ཆེ།
en: The great hero of adamantine origin,

source: །འདམ་སྐྱེས་སྔོན་པོ་འདྲ་བ་འམ།
en: Whose color resembles that of a blue lotus.

source: །ཡང་ན་སྔོ་དང་ཉི་མ་ལྟར།
en: “Alternatively, he should visualize him,

source: །དད་པས་ངེས་པར་བསྒོམ་པར་བྱ།
en: With strong faith, as reddish-blue,

source: །ནམ་མཁར་རྗེ་བཙུན་བལྟས་ནས་ནི།
en: Picturing him, the venerable one, in the sky above

source: །རྡོ་རྗེ་སྐྱེ་བ་སྙིང་རྗེ་ཆེ།
en: As being of adamantine origin and filled with great compassion. “He should worship him by means of visualizing

source: །རྒྱན་རྣམས་ཐམས་ཅད་འཛིན་པ་ཡི། །ལྷ་མོ་བརྒྱད་ཀྱིས་མཆོད་པར་བྱ།
en: The eight goddesses of offerings, adorned with all kinds of jewelry:

source: །དཀར་མོ་རི་དགས་མཚན་པ་འཛིན།
en: Gaurī who is holding a moon disk,

source: །ཆོམ་རྐུན་བདུད་ལས་རྒྱལ་བའི་སྣོད།
en: Caurī holding a sun disk,

source: །རོ་ལངས་མ་ནི་ཆུ་ལག་མ།
en: “Vetalī with a water vessel in her hand,

source: །གྷསྨ་རཱི་ནི་སྨན་འཛིན་ཅིང་།
en: Ghasmarī holding medicines,

source: །པུཀྐ་སཱི་ནི་རྡོ་རྗེ་ལག །དེ་བཞིན་རི་ཁྲོད་མ་རོ་འཛིན།
en: Pukkasī with a vajra scepter in her hand, Śavarī holding tasty foodstuffs,

source: །གདོལ་བ་མོ་ནི་ཅང་ཏེའུ་རྡུང་།
en: “Caṇḍālī sounding a ḍamaru,

source: །གཡུང་མོ་སྐུ་ལ་འཁྱུད་པ་སྟེ།
en: And Ḍombī embracing him around the neck. The lord should be worshiped by these goddesses

source: །མཆོད་པའི་ཆོ་ག་རྒྱས་པ་ཡིས།
en: According to the elaborate ritual procedure for offering.

source: །འདི་རྣམས་ཀྱིས་ནི་གཙོ་བོ་མཆོད།
en: “Then he should become the nature of all phenomena,

source: །དེ་ནས་གནས་ལས་རྣམ་གྲོལ་བའི། །ཆོས་རྣམས་ཀུན་གྱི་བདག་ཉིད་འགྱུར།
en: Which is free from any reference.

source: །ཨཱ་ལི་ཟླ་བ་ཀཱ་ལི་ཉི།
en: He should visualize the seed syllable between the moon and sun disks,

source: །ས་བོན་ནང་དུ་སོན་རིག་པ།
en: Which emerge from the vowels and the consonants respectively.

source: །དེ་ཉིད་སེམས་དཔའ་ཞེས་བྱར་བརྗོད།
en: “That cognition is precisely what is called the being

source: །མཆོག་ཏུ་དགའ་བའི་རང་བཞིན་ཅན།
en: Whose nature is the supreme joy. Forms of light identical to his own body emanate forth,

source: །ནམ་མཁའི་དཀྱིལ་འཁོར་ཁྱབ་པ་ཡི། །རང་གི་ལུས་མཚུངས་རྣམ་པར་སྤྲོ།
en: Flooding the expanse of the sky.

source: །བསྡུས་ནས་སྙིང་གར་དགུག་པ་ན།
en: “Once the practitioner has absorbed them, drawing them back into his heart,

source: །ཡོ་གི་ཞེ་སྡང་བདག་ཉིད་འགྱུར།
en: He should become Heruka—one whose nature is hatred.

source: །ནམ་མཁའི་ཁམས་ཀྱི་ནང་སོན་པར།
en: “In the center of the expanse of the sky

source: །དེ་ནས་ཉི་མའི་དཀྱིལ་འཁོར་བསམ།
en: He should visualize a sun disk.

source: །ཧཱུྃ་སྐྱེས་སྔོ་དང་ཉི་མ་ལྟར།
en: Then from the syllable hūṁ atop the sun disk he arises,

source: །རྒྱན་རྣམས་ཀུན་གྱིས་རྣམ་པར་བརྒྱན།
en: Reddish-blue in color, and adorned with all kinds of jewelry.

source: །ཕྱག་གཉིས་པ་ལ་ཞལ་གཅིག་པ།
en: “He has two arms, one face,

source: །སྤྱན་གསུམ་སྐྲ་ནི་གྱེན་དུ་སེར།
en: Three eyes, and yellow, upward-flowing hair.

source: །སྡང་མིག་བརྒྱད་གཉིས་ལོ་ཡི་དབྱིབས།
en: With an angry gaze, and the body of a sixteen year old,

source: །འཇིགས་བྱེད་མནན་ཅིང་གཡོན་པ་ན།
en: He stands astride Bhairava.

source: །རྡོ་རྗེ་ཁ་ཊྭཱཾ་ག་ཉིད་དང་། །ཐོད་པ་ཡང་ནི་གཡོན་པ་ན།
en: “With a vajra khaṭvāṅga in his left arm, A skull cup in his left hand,

source: །གཡས་ན་རྡོ་རྗེ་ནག་པོ་ཉིད།
en: And a black vajra scepter in his right hand,

source: །ཧཱུྃ་ནི་འདོན་པར་བྱེད་པའི་བདག །ལྷ་མོ་བརྒྱད་ཀྱིས་བསྐོར་ནས་ནི། །དུར་ཁྲོད་དུ་ནི་མགོན་པོ་རོལ།
en: Whose nature is to make the sound hūṁ , “The lord frolics in a charnel ground, Surrounded by the eight goddesses.

source: །དེ་ལྟར་རྣལ་འབྱོར་པས་ནི་བསྒོམ།
en: The practitioner should visualize in this way

source: །རྣལ་འབྱོར་བདུད་རྩི་སྡོམ་པ་ཀུན།
en: The lord who is the supreme ambrosia of all practices.

source: །དེ་ཉིད་བཅོམ་ལྡན་རྣལ་འབྱོར་ཏེ།
en: “He alone is the blessed practice of the union—

source: །རྡོ་རྗེ་སེམས་དཔའ་དེ་བཞིན་གཤེགས།
en: The tathāgata Vajrasattva.

source: །ཁྲོ་བོའི་གཟུགས་ནི་འཛིན་གྱུར་པ།
en: “He should then assume the form of the angry Heruka

source: །ཕྱག་བཞི་ཡིས་ནི་རྣམ་པར་བརྒྱན།
en: Adorned with four arms,

source: །བདུད་བཞི་རྣམ་པར་དག་པ་ནི།
en: Meaning that he is the nature of the four joys
